tutorials/parallelPanel/8-ft-panel-inert/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on;

radiationModel  fvDOM;

noRadiation
{
}

P1Coeffs
{
}

fvDOMCoeffs
{
    nPhi    4;          // azimuthal angles in PI/2 on X-Y.(from Y to X)
    nTheta  4;          // polar angles in PI (from Z to X-Y plane)
    tolerance 1e-2;   // convergence criteria for radiation iteration
    maxIter 5;         // maximum number of iterations
}

// Number of flow iterations per radiation iteration
solverFreq 30;

absorptionEmissionModel constRadFractionEmission;

constRadFractionEmissionCoeffs
{
    EhrrCoeff           0.33;
    radScaling          true;
    Ehrr1               0.33;
    Ehrr2               0.32; // From Tewarson's report, 1986
    patch1              (burner);
    patch2              (region0_to_fuelRegion_fuel);
}

scatterModel    none;

constantScatterCoeffs
{
    sigma           sigma [ 0 -1 0 0 0 0 0 ] 0;
    C               C [ 0 0 0 0 0 0 0 ] 0;
}

cloudScatterCoeffs
{
    cloudNames
    (
    );
}

transmissivityModel    none;

// ************************************************************************* //
