tutorials/parallelPanel/8-ft-panel-inert/constant/reactions
species
(
    O2
    H2O
    C3H8
    CO2
    N2
);

reactions
{
    propaneReaction
    {
        type irreversibleinfiniteReaction;
        reaction "C3H8 + 5O2 + 18.8N2 = 3CO2 + 4H2O + 18.8N2";
    }
}
