tutorials/parallelPanel/8-ft-panel-inert/0/C3H8
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C3H8;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(wall|HFgauge)"
    {
        type            zeroGradient;
    }

    ground           
    {
        type            zeroGradient;
    }

    outlet      
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "(side|Radgauge)"          
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    burner          
    {
        type                totalFlowRateAdvectiveDiffusive;
        massFluxFraction    1;
        phi                 phi;
        rho                 rho;
        value               uniform 1;
    }

    region0_to_fuelRegion_fuel
    {
        type                totalFlowRateAdvectiveDiffusive;
        massFluxFraction    1;
        phi                 phi;
        rho                 rho;
        value               uniform 1;
    }
}


// ************************************************************************* //
