tutorials/parallelPanel/8-ft-panel-inert/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.23301;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }

    ground
    {
        type            zeroGradient;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "(side|Radgauge)"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    burner
    {
        type                totalFlowRateAdvectiveDiffusive;
        massFluxFraction    0;
        phi                 phi;
        rho                 rho;
        value               uniform 0;
    }

    "(region0_to_fuelRegion_fuel|HFgauge)"
    {
        type                totalFlowRateAdvectiveDiffusive;
        massFluxFraction    0;
        phi                 phi;
        rho                 rho;
        value               uniform 0;
    }

}
// ************************************************************************* //
