tutorials/parallelPanel/8-ft-panel-inert/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    wall
    {
        type        fixedValue;
        value       $internalField;
    }

    HFgauge
    {
        type        fixedValue;
        value       uniform 338.0;
    }
    
    ground
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }

    "(side|Radgauge)"
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }

    burner
    {
        type        fixedValue;
        value       uniform 900.0;
    }

    region0_to_fuelRegion_fuel
    {
        type                compressible::pyrolysisTemperatureCoupled;
        Tnbr                T;
        pyrolysisRegion     fuelRegion;
        K                   none;
        kappaMethod         fluidThermo;
        kappaName           none;
        emissivityMode      solidRadiation;
        neighbourFieldRadiativeName     none;
        neighbourFieldConvectiveName    none;
        fieldRadiativeName  qin;
        fieldConvectiveName none;
        value               $internalField;
    }

}
// ************************************************************************* //
