tutorials/parallelPanel/8-ft-panel-inert/0/ph_rgh.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    ground
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "(side|Radgauge)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    burner
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    "(region0_to_fuelRegion_fuel|HFgauge)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

}
// ************************************************************************* //
