tutorials/parallelPanel/8-ft-panel-inert/system/fuelRegion/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 192;

method          scotch;
//method          simple;

simpleCoeffs
{
    n               ( 2 1 1 );
    delta           0.001;
}

structuredCoeffs
{
    method      simple;
    patches     (region0_to_pyrolysisRegion_coupledWall);

    simpleCoeffs
    {
         n               ( 2 1 1 );
         delta           0.001;
    }
}


hierarchicalCoeffs
{
    n               ( 1 2 2 );
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}

metisCoeffs
{
}


// ************************************************************************* //
